## Exer 2 â€“ Data frame creation and manipulation

In [22]:
#Importing the Pandas Library

import pandas as pd

### 1. Create a data frame with details of 10 students and columns as Roll Number, Name, Gender, Marks1, Marks2, Marks3.

In [23]:
#Creating a DataFrame manually
studentDetails = {"Roll Number":[1,2,3,4,5,6,7,8,9,10],"Name":["Karthik","Siddharth","Pranavi","Suresh","Jahnavi","Venkat","Balaji","Anjali","Akshith","Divya"],"Gender":["Male","Male","Female","Male","Female","Male","Male","Female","Male","Female"],"Marks1":[80,35,45,67,75,34,85,76,30,58],"Marks2":[75,38,60,70,28,65,39,75,88,65],"Marks3":[80,55,85,75,86,45,63,84,95,76]}
df = pd.DataFrame(studentDetails)

In [24]:
#Displaying the DataFrame scoreCard.
df

   Roll Number       Name  Gender  Marks1  Marks2  Marks3
0            1    Karthik    Male      80      75      80
1            2  Siddharth    Male      35      38      55
2            3    Pranavi  Female      45      60      85
3            4     Suresh    Male      67      70      75
4            5    Jahnavi  Female      75      28      86
5            6     Venkat    Male      34      65      45
6            7     Balaji    Male      85      39      63
7            8     Anjali  Female      76      75      84
8            9    Akshith    Male      30      88      95
9           10      Divya  Female      58      65      76

### 2. Create a new column with total marks

In [25]:
df["Total Marks"] = df["Marks1"]+df["Marks2"]+df["Marks3"]
df

   Roll Number       Name  Gender  Marks1  Marks2  Marks3  Total Marks
0            1    Karthik    Male      80      75      80          235
1            2  Siddharth    Male      35      38      55          128
2            3    Pranavi  Female      45      60      85          190
3            4     Suresh    Male      67      70      75          212
4            5    Jahnavi  Female      75      28      86          189
5            6     Venkat    Male      34      65      45          144
6            7     Balaji    Male      85      39      63          187
7            8     Anjali  Female      76      75      84          235
8            9    Akshith    Male      30      88      95          213
9           10      Divya  Female      58      65      76          199

### 3. Find the lowest marks in Marks1

In [26]:

df["Marks1"].min()

30

### 4. Find the Highest marks in Marks2

In [27]:
df["Marks2"].max()

88

### 5. Find the average marks in Marks3

In [28]:
df["Marks3"].mean()

74.4

### 6. Find student name with highest average

In [29]:
df["Average"] = (df["Total Marks"])/3
df

,Roll Number,Name,Gender,Marks1,Marks2,Marks3,Total Marks,Average
0,1,Karthik,Male,80,75,80,235,78.333333
1,2,Siddharth,Male,35,38,55,128,42.666667
2,3,Pranavi,Female,45,60,85,190,63.333333
3,4,Suresh,Male,67,70,75,212,70.666667
4,5,Jahnavi,Female,75,28,86,189,63.000000
5,6,Venkat,Male,34,65,45,144,48.000000
6,7,Balaji,Male,85,39,63,187,62.333333
7,8,Anjali,Female,76,75,84,235,78.333333
8,9,Akshith,Male,30,88,95,213,71.000000
9,10,Divya,Female,58,65,76,199,66.333333

In [30]:
df[df["Average"]==df["Average"].max()]["Name"]

0    Karthik
7     Anjali
Name: Name, dtype: object

### 7. Find how many students failed in Marks2 (<40)

In [31]:
#
df[df["Marks2"]<40].Name.count()

3